import { View, Text, Button, StyleSheet } from 'react-native';

export default function ResultScreen({ score, onRestart }: { score: number; onRestart: () => void }) {
  let result = 'Ваш тип темпераменту: ';
  if (score <= 13) result += 'Інтроверт тип особистості, орієнтований «всередину» або «на» себе. Інтровертність — зовсім не те, що сором"язливість або відчуженість, це не патологія. Крім того, цю властивість особистості не можна змінити, навіть якщо вони дуже сильно захочуть. Для інтровертів характерна поведінка, більш пов"язана з комфортною самітністю, внутрішніми роздумами і переживаннями, творчістю або спостереженням за процесом. У типології Леонгарда, екстраверт — особистість безвільна, піддана впливу з боку, в той час як інтроверт — навпаки, особистість вольова. Інтроверти задумливі, тихі і наглядові.';
  else if (score <= 27) result += 'Флегматик-інтроверт: стабільна особистість, повільна, спокійна, пасивна, незворушна, обережна, замислена, мирна, стримана, надійна, спокійна у взаєминах, здатна витримати тривалі негаразди без зривів здоров’я і настрою.';
  else if (score <= 40) result += 'Холерик-інтроверт: цікавий тип особистості, який поєднує у собі риси двох різних характерів. Холерики зазвичай відрізняються високою активністю та енергійністю, а інтроверти – замкнутістю та схильністю до обмірковування своїх переживань. При поєднанні цих характеристик у людини може вийти надзвичайний характер.';
  else if (score <= 55) result += 'Меланхолік-інтроверт: нестабільна особистість, тривожна, песимістична, зовні стримана, але в душі надзвичайно емоційна, чутлива, переймається й переживає, схильна до тривоги, депресій, смутку; у напружених ситуаціях можливі зрив або погіршення діяльності («стрес кролика»).';
  else result += 'Сангвінік-екстраверт: стабільна особистість, соціальний, спрямований до зовнішнього світу, товариська, часом балакуча, безтурботна, весела, любить лідерство, має багато друзів, життєрадісна.';

  return (
    <View style={styles.container}>
      <Text style={styles.result}>{result}</Text>
      <Button title="Пройти ще раз" onPress={onRestart} />
    </View>
  );
}

const styles = StyleSheet.create({
  container: { alignItems: 'center', padding: 20 },
  result: { fontSize: 20, fontWeight: 'bold', marginBottom: 20 },
});